#1-1
a_1=10
b_1=20
print(a_1+b_1)

#1-2
print('%d + %d = %d'%(a_1,b_1,a_1+b_1))

#1-3
print(str(a_1)+' + '+str(b_1)+' = '+str(a_1 + b_1))
'''
#2-1
f_2_1=input('첫 번째 과일을 입력하세요 :')
f_2_2=input('두 번째 과일을 입력하세요 :')
print(str(f_2_1),'와(과)',str(f_2_2),'은(는) 내가 좋아하는 과일이다.',sep=" ")

#2-2
print(str(f_2_1),'와(과) ',str(f_2_2),'은(는) 내가 좋아하는 과일이다.',sep="")

#2-3
print('%s와(과) %s은(는) 내가 좋아하는 과일이다.'%(f_2_1,f_2_2))
'''
'''
#3-1
a_3=int(input('첫 번째 숫자를 입력하세요 :'))
b_3=int(input('두 번째 숫자를 입력하세요 :'))

print( str(a_3)+'/'+str(b_3)+'='+str(a_3/b_3))

#3-2
c_3=a_3/b_3
print('%d/%d = %.2f'%(a_3,b_3,c_3))
'''
#4
'''
m_4_1=input('이메일 주소 앞 부분은? :')
m_4_2=input('이메일 도메인 이름은? :')
print('\n-이메일 주소 : %s@%s'%(m_4_1,m_4_2))
'''
#5
'''
name_5=input('이름을 입력하세요 :')
address_5=input('주소를 입력하세요 :')
pn_5=input('전화번호를 입력하세요(띄어쓰기 없음,-포함) :')

print('-'*50)
print('- 이름: %s'%name_5)
print('- 주소: %s'%address_5)
print('- 전화번호: %s'%pn_5)
'''
#6
'''
a_6=int(input('사다리꼴의 윗변의 길이:'))
b_6=int(input('사다리꼴의 밑변의 길이:'))
c_6=int(input('사다리꼴의 높이:'))

print('-'*50)
print('사다리꼴의 넓이 : '+str((a_6+b_6)*c_6/2)+'cm²')
'''
#7
s='가는 말이 고와야 오는 말이 곱다.'
print(s[6:9])

#8
'''
n_8=input('열 자리 숫자를 입력하세요 :')
print('\n- 추출문자: '+n_8[8:10])
'''

#심화-1


#교재94쪽2-13번